#ifndef __IMPLEMENT_H__
#define __IMPLEMENT_H__
#include "config.h"

//返回1min的平均值 
extern U8 GaitanalyseStepFrequenceMean(void);
extern U8 GaitanalyseStrideLengthMean(void);
extern U8 GaitanalyseStancePercentMean(void);
extern U8 GaitanalyseVerticalLengthMean(void);
extern U16 GaitanalyseSpeedMean(void);
extern U16 GaitanalyseSwingSpeedMean(void);
extern S16 GaitanalyseheelPitchMean(void);
extern S16 GaitanalyseheelRollMean(void);
extern S16 GaitanalysetoePitchMean(void);
//跟风险有关的值 
extern U8 Gaitanalyselandingmode(void);   //内侧1 外侧2 
extern U8 Gaitanalysepes_supinatus(void);//外翻  低1中2高3  
extern U8 Gaitanalysestrephenopodia(void);//内翻  低1中2高3 
extern U8 Gaitanalysepaidirisk(void);//高2 低1 拍地步 
extern U8 Gaitanalysestability(void);//2为稳定性好，1为稳定性较差

/***************************************************************************************************
函数:   获取离地高度 cm
输入:

返回:   离地高度
***************************************************************************************************/
extern U8 GaitanalyseGetVerticalLength(void);
/***************************************************************************************************
函数:   获取活动模式   0代表静止，1代表走路，2代表跑步 一分钟更新一次
输入:

返回:   Pattern
***************************************************************************************************/
extern INT8U ArithmeticGetPattern(void);
extern INT32U ArithmeticGetTotaldistance(void);
/***************************************************************************************************
函数:   获取卡路里
输入:

返回:   卡路里
***************************************************************************************************/
extern INT32U ArithmeticGetEnergy(void);
/***************************************************************************************************
函数:   设置体重  单位：kg
输入:   uW

返回:   无.
***************************************************************************************************/
extern void ArithmeticSetWeight(INT8U uW);
extern INT8U ArithmeticGetWeight(void);
/***************************************************************************************************
函数:   设置身高 单位：cm
输入:   uH

返回:   无.
***************************************************************************************************/
extern void ArithmeticSetHeight(INT8U uH);
extern INT8U ArithmeticGetHeight(void);
/***************************************************************************************************
函数:   获取步数
输入:

返回:   步数
***************************************************************************************************/
extern INT32U ArithmeticGetStepNum(void);
/*******获取左右脚***********/
extern void ArithmeticSetRL(INT8U rl);
/***************************************************************************************************
函数:   获取步频   步/min
输入:

返回:   步频
***************************************************************************************************/
extern U8 GaitanalyseGetStepFrequence(void);
/***************************************************************************************************
函数:   获取步幅  单位cm
输入:

返回:   步幅
***************************************************************************************************/
extern U8 GaitanalyseGetStrideLength(void);
/***************************************************************************************************
函数:   获取步速  cm/min
输入:

返回:   步速
***************************************************************************************************/
extern U16 GaitanalyseGetSpeed(void);
/***************************************************************************************************
函数:   获取摆速  m/s
输入:

返回:   摆速
***************************************************************************************************/
extern U16 GaitanalyseGetswingSpeed(void);
/***************************************************************************************************
函数:   获取支撑相占比
输入:

返回:   支撑相占比
***************************************************************************************************/
extern U8 GaitanalyseGetStancePercent(void); 
/***************************************************************************************************
函数:   清除数据---
输入:

返回:
***************************************************************************************************/
extern void GaitanalyseClearData(void);



extern void ArithProcessNewAccData(INT16S * piNewAcc, INT8U uNum);


#endif